value-tracker/something.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:t arch:headline ^:nil
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:nil e:nil email:t f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:nil title:t toc:nil todo:t |:t
#+TITLE: elect式value-tracker
#+SUBTITLE: 
#+DATE: 
#+AUTHOR: 
#+EMAIL: e.tmailbank@gmail.com
#+LANGUAGE: ja
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 9.0.2)

#+LATEX_CLASS: koma-article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER: 
#+LATEX_HEADER: 
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+STARTUP: indent overview inlineimages
* 目標を絞った現段階での目標
 ある目標　に 対する収益予測APIを組んで見る
 - 例えば...
   　つくば市のコンビニAの売上予想・・・必要なデータ例
|------+------+------+----------+--------+------+----------|
| 内容 | 気温 | 湿度 | 仕入れ量 | 交通量 | 株価 | 人口遷移 |
|------+------+------+----------+--------+------+----------|
| 重み |    5 |    4 |        2 |    5.5 |  0.1 |      0.2 |
|------+------+------+----------+--------+------+----------|
** データの入手
 はじめのデータは既存のデータ提供サービスから入手する。例えば.jsonなどの形式で入手した後、それをデータベースに登録する。最終的には利用者から提供されたデータ（試行に用いられた）データなどの利用も視野に入れたい。
** 検索
 関連性のあるデータを計算に入れることにするが、その関連性のあるデータの選択については現在検討中である。（利用者に選択してもらうスタイルを取る、何らかの学習でサジェストするなど）
** データの出力
 データの出力は利用者の入れたデータに関連して、利用者の求めたデータを返す。
* 担当教員に求めたいもの
 大規模データの機械学習、データベース処理に関する知識。
また、それらをつなげるためのメソッド。
更にそれに関するロードマップの制作。
 *疑問点ができ次第* 質問させていただきたいと思っています。
** 現在質問したい内容
 - 大規模なデータを毎秒単位で収集しなければならない可能性がでてくるが、どうやってコンピュータで処理すべきなのか（メモリ等の問題）
 - 大容量のデータを処理できるデータベースにはどのようなものがふさわしいか（Hbaseでこと足りるのか）
 - データベースと機械学習をつなげるパイプをどのように設計すればいいのか
 - 機械学習全般の知識(学習は主には自分たちでついていく予定です)
* 担当教員に求めないもの
 プログラミング言語の教育技術（使う言語は自分達で学習）
 全体のスケジュール管理（グループリーダーが統括する予定です）
* 具体的な内容を詰めてみる。
** データベース
*** データベースにほしいもの
 より高精度な計算のためあらゆるデータが欲しい（※すべてのデータを計算するかどうかは別）
*** データをどうやって集めるのか
 前項で述べたとおり、初期段階では例えばweather.apiなどからの公開されているデータを、それからは各利用者から与えられるデータを集める。
*** データベースを管理するに当たって
 Hbaseなどの導入を考えている。
*** 処理するデータの量
 取捨選択して毎s〜毎日に合計でGB単位で流し込んでみたい。
** 機械学習
*** 機械学習とは
 初学者ながら、TensorFlowという機械学習のツールを用いることを考えている。他にある素晴らしいツールが目に叶えば、それを用いる。
*** 処理するデータの大きさは
 GB単位になると予想している。
*** 与えられるデータは
 主に数値データを扱う。
* 最終目標
ある目標　ー＞　社会で通用する収益予測APIの作成
公開できる〇〇予測APIにする。
