value-tracker/something.tex
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
		\usepackage[utf8]{inputenc}
		\usepackage[dvipdfmx]{graphicx}
		\usepackage[backend=biber,bibencoding=utf8]{biblatex}
		\usepackage{url}
		\usepackage{indentfirst}
		\usepackage[normalem]{ulem}
		\usepackage{listings}
		\usepackage{amsmath,amssymb}
		\usepackage[dvipdfm]{color}
\author{e.tmailbank@gmail.com}
\date{}
\title{elect式value-tracker}
\begin{document}

\maketitle
\section{最終目標}
\label{sec:orga84613a}
公開できる〇〇予測APIにする。\\
\section{担当教員に求めたいもの}
\label{sec:org9223b6b}
 大規模データの機械学習、データベース処理に関する知識。\\
また、それらをつなげるためのメソッド。\\
 \textbf{疑問点ができ次第} 質問させていただきたいと思っています。\\
\subsection{現在質問したい内容}
\label{sec:orgdd0c5cb}
\begin{itemize}
\item 大規模なデータを毎秒単位で収集しなければならない可能性がでてくるが、どうやってコンピュータで処理すべきなのか（メモリ等の問題）\\
\item 大容量のデータを処理できるデータベースにはどのようなものがふさわしいか（Hbaseでこと足りるのか）\\
\item データベースと機械学習をつなげるパイプをどのように設計すればいいのか\\
\item 機械学習全般の知識(学習は主には自分たちでついていく予定です)\\
\end{itemize}

\section{担当教員に求めないもの}
\label{sec:org7f3fdfb}
プログラミング言語の教育技術（使う言語は自分達で学習）\\
全体のスケジュール管理（グループリーダーが統括する予定です）\\
\section{目標を絞った現段階での目標}
\label{sec:org063b1eb}
すべてのー＞何か　に\\
\begin{itemize}
\item 例えば\ldots{}\\
　コンビニの売上予想・・・必要なデータ例\\
\end{itemize}
\begin{center}
\begin{tabular}{lrrrrrr}
\hline
内容 & 気温 & 湿度 & 仕入れ & 交通量 & 株価 & 人口遷移\\
\hline
重み & 5 & 4 & 2 & 5.5 & 0.1 & 0.2\\
\hline
\end{tabular}
\end{center}
\subsection{データの入手}
\label{sec:orgcd473eb}
はじめのデータは既存のデータ提供サービスから入手する。例えば.jsonなどの形式で入手した後、それをデータベースに登録する。最終的には利用者から提供されたデータ（試行に用いられた）データなどの利用も視野に入れたい。\\
\subsection{検索}
\label{sec:org6a41ea1}
関連性のあるデータを計算に入れることにするが、その関連性のあるデータの選択については現在検討中である。（利用者に選択してもらうスタイルを取る、何らかの学習でサジェストするなど）\\
\subsection{データの出力}
\label{sec:org3358a70}
データの出力は利用者の入れたデータに関連して、利用者の求めたデータを返す。\\
\section{具体的な内容を詰めてみる。}
\label{sec:org33d10c1}
\subsection{データベース}
\label{sec:org7b55c1d}
\subsubsection{データベースにほしいもの}
\label{sec:orgd60b96d}
より高精度な計算のためあらゆるデータが欲しい（※すべてのデータを計算するかどうかは別）\\
\subsubsection{データをどうやって集めるのか}
\label{sec:org381e7e9}
前項で述べたとおり、初期段階では例えばweather.apiなどからの公開されているデータを、それからは各利用者から与えられるデータを集める。\\
\subsubsection{データベースを管理するに当たって}
\label{sec:org2ed1c7c}
Hbaseなどの導入を考えている。\\
\subsubsection{処理するデータの量}
\label{sec:org33d70e9}
取捨選択して毎s〜毎日に合計でGB単位で流し込んでみたい。\\
\subsection{機械学習}
\label{sec:org9d2a476}
\subsubsection{機械学習とは}
\label{sec:orgdf42cfe}
初学者ながら、TensorFlowという機械学習のツールを用いることを考えている。他にある素晴らしいツールが目に叶えば、それを用いる。\\
\subsubsection{処理するデータの大きさは}
\label{sec:org3b7cb86}
GB単位になると予想している。\\
\subsubsection{与えられるデータは}
\label{sec:orgee9988c}
主に数値データを扱う。\\
\end{document}
